InformationRegisters/МоделиФормированияСтоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>МоделиФормированияСтоимости</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МодельФормированияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМоделейФормированияСтоимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравилоРаспределения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаРаспределенияРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтражатьЗатратыДокументом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименованиеМодели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыМоделейФормированияСтоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыМоделейФормированияСтоимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыпускПоРассчитываемойСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпускПоФиксированнойСтоимости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/МоделиФормированияСтоимости/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ЗаполнитьПолноеНаименованиеНастройки();

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Процедура ЗаполнитьПолноеНаименованиеНастройки()
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		
		НаименованиеМодели =
			НСтр("ru='<Настройки не заданы>';uk='<Настройки не задані>'",ОбщегоНазначения.КодОсновногоЯзыка());
		
		ТребуетсяНастройка = Ложь;
		
		Если ТекЗапись.МодельФормированияСтоимости =
			Перечисления.ТипыМоделейФормированияСтоимости.ВыпускПоРассчитываемойСтоимости Тогда
			
			НаименованиеМодели =
				НСтр("ru='Выпуск продукции';uk='Випуск продукції'",ОбщегоНазначения.КодОсновногоЯзыка());
			
		ИначеЕсли ТекЗапись.МодельФормированияСтоимости =
			Перечисления.ТипыМоделейФормированияСтоимости.ВыпускПоФиксированнойСтоимости Тогда
			
			НаименованиеМодели =
				НСтр("ru='Выпуск возвратных отходов';uk='Випуск зворотних відходів'",ОбщегоНазначения.КодОсновногоЯзыка());
			
		Иначе
			
			ТребуетсяНастройка = Истина;
			
		КонецЕсли;
		
		ТекЗапись.ТребуетсяНастройка = ТребуетсяНастройка;
		ТекЗапись.ПолноеНаименованиеМодели = НаименованиеМодели;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
